## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_glue_catalog_database.bes_crm_salesforce_production`     |
|        | `aws_glue_catalog_database.bes_crm_salesforce_production_raw` |
|        | `aws_glue_crawler.bes_crm_salesforce_production`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.bes_crm_salesforce_production will be created
  + resource "aws_glue_catalog_database" "bes_crm_salesforce_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /bes/crm/salesforce/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "bes_crm_salesforce_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.bes_crm_salesforce_production_raw will be created
  + resource "aws_glue_catalog_database" "bes_crm_salesforce_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /bes/crm/salesforce/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "bes_crm_salesforce_production_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.bes_crm_salesforce_production will be created
  + resource "aws_glue_crawler" "bes_crm_salesforce_production" {
      + arn                    = (known after apply)
      + classifiers            = [
          + "json_object_array",
        ]
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 1
                    }
                }
              + CreatePartitionIndex = true
              + Grouping             = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version              = 1
            }
        )
      + database_name          = "bes_crm_salesforce_production"
      + description            = "Classify the CDS Salesforce CRM data"
      + id                     = (known after apply)
      + name                   = "BES / CRM / Salesforce"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + schedule               = "cron(00 7 1 * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "bes_crm_salesforce_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-raw-production/bes/crm/salesforce"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
